Amare Diotte
GLAB 343.1.2
Panda DataFrames

# Example 1: Creating a Pandas DataFrame from Dictionaries

In [1]:
import pandas as pd
import numpy as np

d = {'x': [1, 2, 3], 'y': np.array([2, 4, 8]), 'z': 100}
pd.DataFrame(d)

   x  y    z
0  1  2  100
1  2  4  100
2  3  8  100

In [ ]:
# can specify column order
pd.DataFrame(d, index=[100, 200, 300], columns=['z', 'y', 'x'])

# Example 2.1: Creating a Pandas DataFrame from lists using zip() function

In [2]:
import pandas as pd
patientID = [101,23,48,49]
name=       ['alice','bob','charlie','Eric']
date_of_birth = ['2023-01-01', '2023-01-02', '3/10/2020 143045', '13th of October, 2023']

myDF = pd.DataFrame(zip(patientID, name,date_of_birth), columns=['patientID', 'name', 'date_of_birth'])
myDF

   patientID     name          date_of_birth
0        101    alice             2023-01-01
1         23      bob             2023-01-02
2         48  charlie       3/10/2020 143045
3         49     Eric  13th of October, 2023

# Example 2.2: Creating a Pandas DataFrame from List using Dictionary

In [3]:

l = [{'x': 1, 'y': 2, 'z': 100},
     {'x': 2, 'y': 4, 'z': 100},
     {'x': 3, 'y': 8, 'z': 100}]

pd.DataFrame(l)

   x  y    z
0  1  2  100
1  2  4  100
2  3  8  100

In [4]:
# can also use nested lists
l = [[1, 2, 100],
     [2, 4, 100],
     [3, 8, 100]]

pd.DataFrame(l, columns=['x', 'y', 'z'])

   x  y    z
0  1  2  100
1  2  4  100
2  3  8  100

# Example 3: Creating a pandas DataFrame from NumPy Arrays

In [7]:
import numpy as np
import pandas as pd
arr = np.array([[1, 2, 100],[2, 4, 100],[3, 8, 100]])
df = pd.DataFrame(arr, columns=['x', 'y', 'z'])
df2 = pd.DataFrame(arr, columns=['x', 'y', 'z'], copy=True)

In [8]:
# data frame still points to original array
df
arr[0, 0] = 1000
df

      x  y    z
0  1000  2  100
1     2  4  100
2     3  8  100

In [10]:
df2
arr[0, 0] = 1000
df2

   x  y    z
0  1  2  100
1  2  4  100
2  3  8  100